let IPList  = externaldata(IPAddress:string)[@"https://intelfeeds.securonix.net/basic_sdsgwe/domain_mklrvl.csv"] with (format="csv", ignoreFirstRecord=True);
let IPRegex = '[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}';
let DnsIP = DnsEvents 
| summarize by IPAddress = IPAddresses, Type;
let ipsort = union isfuzzy=true DnsIP
| summarize by IPAddress
| where isnotempty(IPAddress) | where not(ipv4_is_private(IPAddress)) and IPAddress !in ('0.0.0.0','127.0.0.1');
let ipMatch = ipsort | where IPAddress in (IPList);
DnsEvents
| where  IPAddresses has_any (ipMatch)
| project TimeGenerated, Computer, IPAddresses, Name, ClientIP, Type
| extend DestinationIPAddress = IPAddresses,  Host = Computer
| extend timestamp = TimeGenerated, IPCustomEntity = DestinationIPAddress, HostCustomEntity = Host

// Seveirty  High
// Tactics Impact
// Look back time 5 min
// runs every 5 min
