{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e7046e9f-27ad-4437-bdc9-c1f6306ab11b')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e7046e9f-27ad-4437-bdc9-c1f6306ab11b')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01-preview",
            "properties": {
                "displayName": "Monjasa Detection of Dropbox download",
                "description": "This querry will trigger an alert when any user content downloads from dropbox that originate from a link/redirect from a 3rd party site",
                "severity": "Medium",
                "enabled": true,
                "query": "DeviceFileEvents\n| where \n    Timestamp > ago(7d)\n    and FileOriginUrl startswith \"https://dl.dropboxusercontent.com/\"\n    and isnotempty(FileOriginReferrerUrl)\n    and FileOriginReferrerUrl !startswith \"https://www.dropbox.com/\" \n| project FileOriginReferrerUrl, FileName \n",
                "queryFrequency": "PT5H",
                "queryPeriod": "PT5H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "CredentialAccess"
                ],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "FileName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        }
    ]
}